[UICustomize_AlienInfo]
m_strTitle=编辑外星人信息
m_strFirstNameLabel=名字
m_strLastNameLabel=姓氏
m_strNicknameLabel=昵称
m_strEditBiography=传记
m_strGender=性别
m_strNationality=国籍
m_strBiographyLabel=人物传记

[XGCharacterGenerator_PlayableAliens]
	m_arrMecFirstNames[0]="亚当"
	m_arrMecFirstNames[1]="Amee"
	m_arrMecFirstNames[2]="灰烬"
	m_arrMecFirstNames[3]="Astro"
	m_arrMecFirstNames[4]="艾娃"
	m_arrMecFirstNames[5]="大白"
	m_arrMecFirstNames[6]="测试版"
	m_arrMecFirstNames[7]="主教"
	m_arrMecFirstNames[8]="博珀"
	m_arrMecFirstNames[9]="糖果"
	m_arrMecFirstNames[10]="Chappie"
	m_arrMecFirstNames[11]="樱桃"
	m_arrMecFirstNames[12]="芯片"
	m_arrMecFirstNames[13]="可爱"
	m_arrMecFirstNames[14]="机器人"
	m_arrMecFirstNames[15]="丹尼尔"
	m_arrMecFirstNames[16]="达里尔"
	m_arrMecFirstNames[17]="数据"
	m_arrMecFirstNames[18]="杜威"
	m_arrMecFirstNames[19]="夏娃"
	m_arrMecFirstNames[20]="获取器"
	m_arrMecFirstNames[21]="银河系"
	m_arrMecFirstNames[22]="Gerty"
	m_arrMecFirstNames[23]="兴奋"
	m_arrMecFirstNames[24]="吉斯卡德"
	m_arrMecFirstNames[25]="哈莉"
	m_arrMecFirstNames[26]="避风港"
	m_arrMecFirstNames[27]="爱马仕"
	m_arrMecFirstNames[28]="香港"
	m_arrMecFirstNames[29]="休伊"
	m_arrMecFirstNames[30]="喷气飞机"
	m_arrMecFirstNames[31]="约翰尼"
	m_arrMecFirstNames[32]="垃圾人"
	m_arrMecFirstNames[33]="洛马克斯"
	m_arrMecFirstNames[34]="路西法"
	m_arrMecFirstNames[35]="马文"
	m_arrMecFirstNames[36]="矩阵"
	m_arrMecFirstNames[37]="最大"
	m_arrMecFirstNames[38]="机械"
	m_arrMecFirstNames[39]="游牧民族"
	m_arrMecFirstNames[40]="诺比"
	m_arrMecFirstNames[41]="诺曼"
	m_arrMecFirstNames[42]="全机器人"
	m_arrMecFirstNames[43]="擎天柱"
	m_arrMecFirstNames[44]="价格"
	m_arrMecFirstNames[45]="普罗透斯"
	m_arrMecFirstNames[46]="探索者"
	m_arrMecFirstNames[47]="Rapbot"
	m_arrMecFirstNames[48]="雷娜"
	m_arrMecFirstNames[51]="罗西"
	m_arrMecFirstNames[52]="鲁克"
	m_arrMecFirstNames[53]="山姆"
	m_arrMecFirstNames[54]="哨兵"
	m_arrMecFirstNames[55]="伺服"
	m_arrMecFirstNames[56]="火花"
	m_arrMecFirstNames[57]="快速"
	m_arrMecFirstNames[58]="斯特拉"
	m_arrMecFirstNames[59]="斯蒂芬福德"
	m_arrMecFirstNames[60]="塔洛斯"
	m_arrMecFirstNames[61]="Tars"
	m_arrMecFirstNames[62]="抖音"
	m_arrMecFirstNames[63]="特鲁迪"
	m_arrMecFirstNames[64]="奥创"
	m_arrMecFirstNames[65]="尤利西斯"
	m_arrMecFirstNames[66]="向量"
	m_arrMecFirstNames[67]="文森特"
	m_arrMecFirstNames[68]="Weebo"
	m_arrMecFirstNames[69]="Zhora"

	m_arrMecLastNames[0]="4"
	m_arrMecLastNames[1]="7"
	m_arrMecLastNames[2]="12"
	m_arrMecLastNames[3]="15"
	m_arrMecLastNames[4]="20"
	m_arrMecLastNames[5]="30"
	m_arrMecLastNames[6]="50"
	m_arrMecLastNames[7]="500"
	m_arrMecLastNames[8]="总理"
	m_arrMecLastNames[9]="600"
	m_arrMecLastNames[10]="800"
	m_arrMecLastNames[11]="1000"
	m_arrMecLastNames[12]="2000"
	m_arrMecLastNames[13]="4000"
	m_arrMecLastNames[14]="2"
	m_arrMecLastNames[15]="9"
	m_arrMecLastNames[16]="10"
	m_arrMecLastNames[17]="17"
	m_arrMecLastNames[18]="23"
	m_arrMecLastNames[19]="11"
	m_arrMecLastNames[20]="16"
	m_arrMecLastNames[21]="32"
	m_arrMecLastNames[22]="马克西姆斯"
	m_arrMecLastNames[23]="47"
	m_arrMecLastNames[24]="72"
	m_arrMecLastNames[25]="45"
	m_arrMecLastNames[26]="21"
	m_arrMecLastNames[27]="39"
	m_arrMecLastNames[28]="42"
	m_arrMecLastNames[29]="6"
	m_arrMecLastNames[30]="19"
	m_arrMecLastNames[31]="37"
	m_arrMecLastNames[32]="测试版"
	m_arrMecLastNames[33]="阿尔法"
	m_arrMecLastNames[34]="欧米茄"
	m_arrMecLastNames[35]="奥密克戎"
	m_arrMecLastNames[36]="Lambda"
	m_arrMecLastNames[37]="泽塔"
	m_arrMecLastNames[38]="艾普西隆"
	m_arrMecLastNames[39]="Rho"

	m_arrVprFirstNames[0]="简"
	m_arrVprFirstNames[1]="Miia"
	m_arrVprFirstNames[2]="爱丽丝"
	m_arrVprFirstNames[3]="瓦斯琪"
	m_arrVprFirstNames[4]="阿蒂萨"
	m_arrVprFirstNames[5]="Vespia"
	m_arrVprFirstNames[6]="艾萨拉"
	m_arrVprFirstNames[7]="Scilla"
	m_arrVprFirstNames[8]="潮汐幽灵"

	m_arrVprLastNames[0]="大靴子"
	m_arrVprLastNames[1]="大靴子"
	m_arrVprLastNames[2]="小浆果"
	m_arrVprLastNames[3]="谨慎行者"
	m_arrVprLastNames[4]="酋长"
	m_arrVprLastNames[5]="郊狼"
	m_arrVprLastNames[6]="埃姆达尔"
	m_arrVprLastNames[7]="雏鸟"
	m_arrVprLastNames[8]="甘特"
	m_arrVprLastNames[9]="皮革底部"
	m_arrVprLastNames[10]="冰柱男孩"
	m_arrVprLastNames[11]="泡菜"
	m_arrVprLastNames[12]="小约翰"
	m_arrVprLastNames[13]="Manyjars"
	m_arrVprLastNames[14]="泥头"
	m_arrVprLastNames[15]="呀呀"
	m_arrVprLastNames[16]="鹦鹉"
	m_arrVprLastNames[17]="沃尔芬"
	m_arrVprLastNames[18]="准备起飞"
	m_arrVprLastNames[19]="重复舞蹈"
	m_arrVprLastNames[20]="小浆果"
	m_arrVprLastNames[21]="星鸟"
	m_arrVprLastNames[22]="掩护"
	m_arrVprLastNames[23]="荆棘棒"
	m_arrVprLastNames[24]="双角兽"
	m_arrVprLastNames[25]="价值"
	m_arrVprLastNames[26]="Doe"
	m_arrVprLastNames[27]="呀呀"

	m_arrMutMFirstNames[0]="巴多克"
	m_arrMutMFirstNames[1]="伯博克"
	m_arrMutMFirstNames[2]="博尔丹"
	m_arrMutMFirstNames[3]="布里夫拉克"
	m_arrMutMFirstNames[4]="布鲁坎"
	m_arrMutMFirstNames[5]="布鲁塔鲁姆"
	m_arrMutMFirstNames[6]="Curlok"
	m_arrMutMFirstNames[7]="德罗卡罗"
	m_arrMutMFirstNames[8]="法坎"
	m_arrMutMFirstNames[9]="法蒂拉克"
	m_arrMutMFirstNames[10]="戈克莫尔"
	m_arrMutMFirstNames[11]="格拉洛克"
	m_arrMutMFirstNames[12]="格罗蒂拉克"
	m_arrMutMFirstNames[13]="格鲁克"
	m_arrMutMFirstNames[14]="古尔达克"
	m_arrMutMFirstNames[15]="杰克"
	m_arrMutMFirstNames[16]="尤蒂拉克"
	m_arrMutMFirstNames[17]="科尔"
	m_arrMutMFirstNames[18]="科塔罗克"
	m_arrMutMFirstNames[19]="克雷布拉基尔"
	m_arrMutMFirstNames[20]="克罗克拉克斯"
	m_arrMutMFirstNames[21]="克罗塔罗格"
	m_arrMutMFirstNames[22]="克鲁克莫尔"
	m_arrMutMFirstNames[23]="穆洛特"
	m_arrMutMFirstNames[24]="我愿意"
	m_arrMutMFirstNames[25]="尼克"
	m_arrMutMFirstNames[26]="努尔达克"
	m_arrMutMFirstNames[27]="帕塔伦"
	m_arrMutMFirstNames[28]="普雷丹"
	m_arrMutMFirstNames[29]="Qetarok"
	m_arrMutMFirstNames[30]="Qirdon"
	m_arrMutMFirstNames[31]="Qrirsan"
	m_arrMutMFirstNames[32]="Qrubrakir"
	m_arrMutMFirstNames[33]="兰托"
	m_arrMutMFirstNames[34]="鲁克玛"
	m_arrMutMFirstNames[35]="斯拉塔伦"
	m_arrMutMFirstNames[36]="斯特鲁坎"
	m_arrMutMFirstNames[37]="苏尔塔克"
	m_arrMutMFirstNames[38]="Tedrax"
	m_arrMutMFirstNames[39]="瓦卡罗尔"
	m_arrMutMFirstNames[40]="瓦瓦诺尔"
	m_arrMutMFirstNames[41]="弗利塔罗格"
	m_arrMutMFirstNames[42]="沃邦"
	m_arrMutMFirstNames[43]="Wradtar"
	m_arrMutMFirstNames[44]="瓦拉桑"
	m_arrMutMFirstNames[45]="Wrevarog"
	m_arrMutMFirstNames[46]="Wrik"
	m_arrMutMFirstNames[47]="沃纳"
	m_arrMutMFirstNames[48]="沃尔坎"
	m_arrMutMFirstNames[49]="兹罗达克"

	m_arrMutFFirstNames[0]="西雷拉"
	m_arrMutFFirstNames[1]="申纳拉"
	m_arrMutFFirstNames[2]="卡拉娜"
	m_arrMutFFirstNames[3]="塔拉杰"
	m_arrMutFFirstNames[4]="K'Rene"
	m_arrMutFFirstNames[5]="Vixis"
	m_arrMutFFirstNames[6]="K'Ehleyr"
	m_arrMutFFirstNames[7]="格里尔卡"
	m_arrMutFFirstNames[8]="多兰"
	m_arrMutFFirstNames[9]="Ch'Rega"

	m_arrMutLastNames[0]="巴格"
	m_arrMutLastNames[1]="布里戈尔"
	m_arrMutLastNames[2]="查戈尔"
	m_arrMutLastNames[3]="Chayax"
	m_arrMutLastNames[4]="克拉拉克"
	m_arrMutLastNames[5]="克拉德"
	m_arrMutLastNames[6]="批评"
	m_arrMutLastNames[7]="库拉克"
	m_arrMutLastNames[8]="库斯克"
	m_arrMutLastNames[9]="德格"
	m_arrMutLastNames[10]="格拉茨克"
	m_arrMutLastNames[11]="格里卡"
	m_arrMutLastNames[12]="格鲁鲁"
	m_arrMutLastNames[13]="古尔"
	m_arrMutLastNames[14]="古恩"
	m_arrMutLastNames[15]="吉格"
	m_arrMutLastNames[16]="吉拉克"
	m_arrMutLastNames[17]="卡拉科"
	m_arrMutLastNames[18]="凯科尔"
	m_arrMutLastNames[19]="卡尔"
	m_arrMutLastNames[20]="基尔"
	m_arrMutLastNames[21]="克罗亚斯"
	m_arrMutLastNames[22]="普里科尔"
	m_arrMutLastNames[23]="普鲁斯克"
	m_arrMutLastNames[24]="普亚斯"
	m_arrMutLastNames[25]="Qirm"
	m_arrMutLastNames[26]="Qonka"
	m_arrMutLastNames[27]="Qragg"
	m_arrMutLastNames[28]="Q等级"
	m_arrMutLastNames[29]="Qrix"
	m_arrMutLastNames[30]="随机"
	m_arrMutLastNames[31]="拉斯克"
	m_arrMutLastNames[32]="里兹克"
	m_arrMutLastNames[33]="塞尔德"
	m_arrMutLastNames[34]="索恩"
	m_arrMutLastNames[35]="斯里尔"
	m_arrMutLastNames[36]="斯罗拉基"
	m_arrMutLastNames[37]="泰戈拉"
	m_arrMutLastNames[38]="特德"
	m_arrMutLastNames[39]="特拉拉基"
	m_arrMutLastNames[40]="维亚克"
	m_arrMutLastNames[41]="弗鲁卡罗"
	m_arrMutLastNames[42]="沃恩"
	m_arrMutLastNames[43]="乌加雷"
	m_arrMutLastNames[44]="兹雷亚斯"
	m_arrMutLastNames[45]="祖格"
	m_arrMutLastNames[46]="Zrurn"

	m_arrVprMFirstNames[0]="Janus"
	m_arrVprMFirstNames[1]="Magnus"
	m_arrVprMFirstNames[2]="Ajax"
	m_arrVprMFirstNames[3]="Vasharus"
	m_arrVprMFirstNames[4]="Oxylus"
	m_arrVprMFirstNames[5]="Darios"
	m_arrVprMFirstNames[6]="Lorx"
	m_arrVprMFirstNames[7]="Scilx"
	m_arrVprMFirstNames[8]="Irikalos"
	m_arrVprMFirstNames[9]="Daydalos"

	m_arrVprMLastNames[0]="Icescale"
	m_arrVprMLastNames[1]="Ferrus"
	m_arrVprMLastNames[2]="Najata"
	m_arrVprMLastNames[3]="Azshalax"
	m_arrVprMLastNames[4]="Zarilx"
	m_arrVprMLastNames[5]="Urax"
	m_arrVprMLastNames[6]="Aigo"
	m_arrVprMLastNames[7]="Lex"
	m_arrVprMLastNames[7]="Nargarus"

[X2StatusEffects_Radiation]
RadBurningFriendlyName="辐射燃烧"
RadBurningFriendlyDesc="射燃烧的单位会随着时间推移而受到伤害，并且闪避和防御会降低"
RadBurningEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 正在辐射燃烧."
RadBurningEffectTickedString="<XGParam:StrValue0/!UnitName/> 仍在辐射燃烧."
RadBurningEffectLostString="<XGParam:StrValue0/!UnitName/> 不再辐射燃烧."

BoilingBloodFriendlyName="血液沸腾"
BoilingBloodFriendlyDesc="被沸腾之血影响的单位会受到随机伤害，命中和移动力会降低"
BoilingBloodEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 正在血液沸腾."
BoilingBloodEffectTickedString="<XGParam:StrValue0/!UnitName/> 仍在血液沸腾."
BoilingBloodEffectLostString="<XGParam:StrValue0/!UnitName/> 不再血液沸腾."

IrradiatedFriendlyName="已辐射"
IrradiatedFriendlyDesc="被辐射的单位会受到命中和移动力惩罚，机器也会受到影响，并且黑客防御会降低"
IrradiatedEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 已辐射."
IrradiatedEffectTickedString="<XGParam:StrValue0/!UnitName/> 仍在辐射."
IrradiatedEffectLostString="<XGParam:StrValue0/!UnitName/> 不再辐射."

LostRadRegenFriendlyName="辐射再生"
LostRadRegenFriendlyDesc="失魂者单位在受到辐射影响时会恢复"
LostRadRegenEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 正在辐射再生."
LostRadRegenEffectTickedString="<XGParam:StrValue0/!UnitName/> 仍在辐射再生."
LostRadRegenEffectLostString="<XGParam:StrValue0/!UnitName/> 不再辐射再生."

[UIEventNoticesTactical_Radiation]
RadBurningTitle="辐射燃烧"
RadBleedingTitle="血液沸腾"
RadDisorientedTitle="已辐射"

[X2Ability_LancingGun]
LancingGunMarkEffectName="长矛标记"
LancingGunMarkEffectDesc="被长矛标记的目标受到额外伤害"

[X2Effect_LancingGun]
LancingGunRemoved="长矛标记已移除"

[UIEventNoticesTactical_Ripple]
PsiRippleTitle="灵能涟漪"

[X2StatusEffects_RipplingRifle]
PsiRippleFriendlyName="灵能涟漪"
PsiRippleFriendlyDesc="灵能涟漪单位会受到持续伤害，并能以相同的效果感染附近的盟友"
PsiRippleEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 正在灵能涟漪."
PsiRippleEffectTickedString="<XGParam:StrValue0/!UnitName/> 仍在灵能涟漪."
PsiRippleEffectLostString="<XGParam:StrValue0/!UnitName/> 不再灵能涟漪."
